In [156]:
import pandas as pd
import numpy as np

people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [157]:
# üß≠üß≠ Two major scenarios of null (na) values
# 1 of 2: deal with True Null cells: np.nan or None Â§ÑÁêÜÁúüÁ©∫ÂÄº
# 2 of 2: deal with Fake Non-Null cells: 'NA', 'n/a', 'missing', ... (pretending in string format) Â§ÑÁêÜ‰º™Ë£ÖÊàêÈùûÁ©∫ÁöÑÂπ≤Êâ∞ÂÄº

df = pd.DataFrame(people)

df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [158]:
# ‚úÖ Is there any to applymap() to all the BLANK cells E.g. replace ALL Blank Cells with certain strings
# üß† df.fillna()

df.fillna('BLANK_CELL')  # inplace=True

        first        last                    email         age
0       Corey     Schafer  CoreyMSchafer@gmail.com          33
1        Jane         Doe        JaneDoe@email.com          55
2        John         Doe        JohnDoe@email.com          63
3       Chris     Schafer               BLANK_CELL          36
4  BLANK_CELL  BLANK_CELL               BLANK_CELL  BLANK_CELL
5  BLANK_CELL  BLANK_CELL      Anonymous@email.com  BLANK_CELL
6          NA     Missing                       NA     Missing

In [148]:
# Test if data can be replaced with replace() method

df.replace({
    None: 0,
    'NA': 1,
    'Missing': 2,
})

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      1        2                        1   2

In [137]:
df.replace({
    'NA': None,
    'Missing': None,
}, inplace=True)

In [139]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [140]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6   None     None                     None  None

In [143]:
# üß† df.dropna(axis=, subset=, how=, )

df.dropna(
    axis=0, 
    subset=['first', 'last', 'email'],
    how='all',
    inplace=True
    )

In [144]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None